In [91]:
# Importing necessary libraries
import pandas as pd          # for handling dataframes and CSV files
import numpy as np           # for handling NaN values and numerical operations

In [92]:
# creating employee data
employee_data = {
    "ID": ["A001", "A002", "A003", "A004", "A005"],
    "Name": ["John Alter", "Alice Luxumberg", "Tom Sabestine", "Nina Adgra", "Amy Johny"],
    "Gender": ["M", "F", "M", "F", "F"],
    "City": ["Paris", "London", "Berlin", "Newyork", "Madrid"],
    "Age": [25, 27, 29, 31, 30]
}
employee_df = pd.DataFrame(employee_data)
employee_df

     ID             Name Gender     City  Age
0  A001       John Alter      M    Paris   25
1  A002  Alice Luxumberg      F   London   27
2  A003    Tom Sabestine      M   Berlin   29
3  A004       Nina Adgra      F  Newyork   31
4  A005        Amy Johny      F   Madrid   30

In [93]:
# creating seniority data
seniority_data = {
    "ID": ["A001", "A002", "A003", "A004", "A005"],
    "Designation Level": [2, 2, 3, 2, 3]
}
seniority_df = pd.DataFrame(seniority_data)
seniority_df

     ID  Designation Level
0  A001                  2
1  A002                  2
2  A003                  3
3  A004                  2
4  A005                  3

In [94]:
# creating project data
project_data = {
    "ID": ["A001","A002","A003","A004","A005","A002","A005","A003","A001","A003","A001","A004","A004","A005"],
    "Project": ["Project 1","Project 2","Project 3","Project 4","Project 5","Project 6","Project 7","Project 8","Project 9","Project 10","Project 11","Project 12","Project 13","Project 14"],
    "Cost": [1002000, 2000000, 4500000, 5500000, np.nan, 680000, 400000, 350000, np.nan, 300000, 2000000, 1000000, 3000000, 200000],
    "Status": ["Finished","Ongoing","Finished","Ongoing","Finished","Failed","Finished","Failed","Ongoing","Finished","Failed","Ongoing","Finished","Finished"]
}
project_df = pd.DataFrame(project_data)
project_df

      ID     Project       Cost    Status
0   A001   Project 1  1002000.0  Finished
1   A002   Project 2  2000000.0   Ongoing
2   A003   Project 3  4500000.0  Finished
3   A004   Project 4  5500000.0   Ongoing
4   A005   Project 5        NaN  Finished
5   A002   Project 6   680000.0    Failed
6   A005   Project 7   400000.0  Finished
7   A003   Project 8   350000.0    Failed
8   A001   Project 9        NaN   Ongoing
9   A003  Project 10   300000.0  Finished
10  A001  Project 11  2000000.0    Failed
11  A004  Project 12  1000000.0   Ongoing
12  A004  Project 13  3000000.0  Finished
13  A005  Project 14   200000.0  Finished

In [95]:
# saving all dataframes to csv
employee_df.to_csv('employee_data.csv', index=False)
seniority_df.to_csv('seniority_data.csv', index=False)
project_df.to_csv('project_data.csv', index=False)

print("CSV files created successfully")

CSV files created successfully

In [96]:
# Task 2
# The cost column in the dataframe “Project” has some missing values. 
# Your task is to compute these missing values.
# Replace the missing values by running average. 
# You should use the “For” loop for this task.

In [97]:
# reading the file
project_df = pd.read_csv("project_data.csv")

# checking data before filling
print("Before filling missing values:\n")
print(project_df)

# finding how many missing values are there
print("Missing values:", project_df["Cost"].isna().sum())

# variables to keep total and count
total = 0
count = 0

# copying the cost column
costs = project_df["Cost"].values.copy()

# loop to fill missing values
for i in range(len(costs)):
    if np.isnan(costs[i]):
        if count > 0:
            avg = total / count
        else:
            avg = 0
        costs[i] = avg
        print("Filled value at index", i, "with", avg)
    total += costs[i]
    count += 1

# updating the dataframe
project_df["Cost"] = costs

# printing after filling
print("\nAfter filling missing values:\n")
print(project_df)
print("Missing values:", project_df["Cost"].isna().sum())

# saving the file
project_df.to_csv("project_data.csv", index=False)
print("\nFile saved.")

Before filling missing values:

      ID     Project       Cost    Status
0   A001   Project 1  1002000.0  Finished
1   A002   Project 2  2000000.0   Ongoing
2   A003   Project 3  4500000.0  Finished
3   A004   Project 4  5500000.0   Ongoing
4   A005   Project 5        NaN  Finished
5   A002   Project 6   680000.0    Failed
6   A005   Project 7   400000.0  Finished
7   A003   Project 8   350000.0    Failed
8   A001   Project 9        NaN   Ongoing
9   A003  Project 10   300000.0  Finished
10  A001  Project 11  2000000.0    Failed
11  A004  Project 12  1000000.0   Ongoing
12  A004  Project 13  3000000.0  Finished
13  A005  Project 14   200000.0  Finished
Missing values: 2
Filled value at index 4 with 3250500.0
Filled value at index 8 with 2210312.5

After filling missing values:

      ID     Project       Cost    Status
0   A001   Project 1  1002000.0  Finished
1   A002   Project 2  2000000.0   Ongoing
2   A003   Project 3  4500000.0  Finished
3   A004   Project 4  5500000.0   Ongoing
4   A005   Project 5  3250500.0  Finished
5   A002   Project 6   680000.0    Failed
6   A005   Project 7   400000.0  Finished
7   A003   Project 8   350000.0    Failed
8   A001   Project 9  2210312.5   Ongoing
9   A003  Project 10   300000.0  Finished
10  A001  Project 11  2000000.0    Failed
11  A004  Project 12  1000000.0   Ongoing
12  A004  Project 13  3000000.0  Finished
13  A005  Project 14   200000.0  Finished
Missing values: 0

File saved.

In [98]:
project_df

      ID     Project       Cost    Status
0   A001   Project 1  1002000.0  Finished
1   A002   Project 2  2000000.0   Ongoing
2   A003   Project 3  4500000.0  Finished
3   A004   Project 4  5500000.0   Ongoing
4   A005   Project 5  3250500.0  Finished
5   A002   Project 6   680000.0    Failed
6   A005   Project 7   400000.0  Finished
7   A003   Project 8   350000.0    Failed
8   A001   Project 9  2210312.5   Ongoing
9   A003  Project 10   300000.0  Finished
10  A001  Project 11  2000000.0    Failed
11  A004  Project 12  1000000.0   Ongoing
12  A004  Project 13  3000000.0  Finished
13  A005  Project 14   200000.0  Finished

In [99]:
# Task 3
# Split the name column in the Employee dataframe into two new columns.
# “First Name”, and “Last Name” and remove the older “name” column.

In [100]:
employee_df = pd.read_csv("employee_data.csv") 

print("Before splitting Name column:\n")
print(employee_df)
print("\nColumns:", list(employee_df.columns))

# Splitting the Name column into two parts: First Name and Last Name
employee_df[['First Name', 'Last Name']] = employee_df['Name'].str.split(' ', n=1, expand=True)

# Droping the old Name column
employee_df = employee_df.drop('Name', axis=1)

# Reordering columns for better readability
column_order = ['ID', 'First Name', 'Last Name', 'Gender', 'City', 'Age']
employee_df = employee_df[column_order]

print("\n" + "="*60)
print("After splitting Name column:")
print("="*60)
print(employee_df)
print("\nColumns:", list(employee_df.columns))

# then saving the cleaned file
employee_df.to_csv("employee_data.csv", index=False)
print("\n File saved successfully")

Before splitting Name column:

     ID             Name Gender     City  Age
0  A001       John Alter      M    Paris   25
1  A002  Alice Luxumberg      F   London   27
2  A003    Tom Sabestine      M   Berlin   29
3  A004       Nina Adgra      F  Newyork   31
4  A005        Amy Johny      F   Madrid   30

Columns: ['ID', 'Name', 'Gender', 'City', 'Age']

============================================================
After splitting Name column:
============================================================
     ID First Name  Last Name Gender     City  Age
0  A001       John      Alter      M    Paris   25
1  A002      Alice  Luxumberg      F   London   27
2  A003        Tom  Sabestine      M   Berlin   29
3  A004       Nina      Adgra      F  Newyork   31
4  A005        Amy      Johny      F   Madrid   30

Columns: ['ID', 'First Name', 'Last Name', 'Gender', 'City', 'Age']

 File saved successfully

In [101]:
# Checking if the changes are saved
employee_df

     ID First Name  Last Name Gender     City  Age
0  A001       John      Alter      M    Paris   25
1  A002      Alice  Luxumberg      F   London   27
2  A003        Tom  Sabestine      M   Berlin   29
3  A004       Nina      Adgra      F  Newyork   31
4  A005        Amy      Johny      F   Madrid   30

In [102]:
# Task 4
# Join all three dataframes in one single dataframe. Name it “Final”

In [103]:
# reading all csv files
employee_df = pd.read_csv("employee_data.csv")
seniority_df = pd.read_csv("seniority_data.csv")
project_df = pd.read_csv("project_data.csv")

# checking if files are loaded
print("Employee data:\n", employee_df)
print("\nSeniority data:\n", seniority_df)
print("\nProject data:\n", project_df)

# merging employee and seniority data
temp = pd.merge(employee_df, seniority_df, on='ID', how='inner')

# merging the result with project data
Final = pd.merge(temp, project_df, on='ID', how='inner')

# printing final merged data
print("\nFinal merged data:\n", Final)

# saving the file
Final.to_csv("final_data.csv", index=False)
print("\nFile saved as final_data.csv")

# checking some details
print("\nTotal rows:", len(Final))
print("Unique employees:", Final['ID'].nunique())
print("\nProjects per employee:")
print(Final['ID'].value_counts())

Employee data:
      ID First Name  Last Name Gender     City  Age
0  A001       John      Alter      M    Paris   25
1  A002      Alice  Luxumberg      F   London   27
2  A003        Tom  Sabestine      M   Berlin   29
3  A004       Nina      Adgra      F  Newyork   31
4  A005        Amy      Johny      F   Madrid   30

Seniority data:
      ID  Designation Level
0  A001                  2
1  A002                  2
2  A003                  3
3  A004                  2
4  A005                  3

Project data:
       ID     Project       Cost    Status
0   A001   Project 1  1002000.0  Finished
1   A002   Project 2  2000000.0   Ongoing
2   A003   Project 3  4500000.0  Finished
3   A004   Project 4  5500000.0   Ongoing
4   A005   Project 5  3250500.0  Finished
5   A002   Project 6   680000.0    Failed
6   A005   Project 7   400000.0  Finished
7   A003   Project 8   350000.0    Failed
8   A001   Project 9  2210312.5   Ongoing
9   A003  Project 10   300000.0  Finished
10  A001  Project 11  2000000.0    Failed
11  A004  Project 12  1000000.0   Ongoing
12  A004  Project 13  3000000.0  Finished
13  A005  Project 14   200000.0  Finished

Final merged data:
       ID First Name  Last Name Gender     City  Age  Designation Level  \
0   A001       John      Alter      M    Paris   25                  2
1   A001       John      Alter      M    Paris   25                  2
2   A001       John      Alter      M    Paris   25                  2
3   A002      Alice  Luxumberg      F   London   27                  2
4   A002      Alice  Luxumberg      F   London   27                  2
5   A003        Tom  Sabestine      M   Berlin   29                  3
6   A003        Tom  Sabestine      M   Berlin   29                  3
7   A003        Tom  Sabestine      M   Berlin   29                  3
8   A004       Nina      Adgra      F  Newyork   31                  2
9   A004       Nina      Adgra      F  Newyork   31                  2
10  A004       Nina      Adgra      F  Newyork   31                  2
11  A005        Amy      Johny      F   Madrid   30                  3
12  A005        Amy      Johny      F   Madrid   30                  3
13  A005        Amy      Johny      F   Madrid   30                  3

       Project       Cost    Status
0    Project 1  1002000.0  Finished
1    Project 9  2210312.5   Ongoing
2   Project 11  2000000.0    Failed
3    Project 2  2000000.0   Ongoing
4    Project 6   680000.0    Failed
5    Project 3  4500000.0  Finished
6    Project 8   350000.0    Failed
7   Project 10   300000.0  Finished
8    Project 4  5500000.0   Ongoing
9   Project 12  1000000.0   Ongoing
10  Project 13  3000000.0  Finished
11   Project 5  3250500.0  Finished
12   Project 7   400000.0  Finished
13  Project 14   200000.0  Finished

File saved as final_data.csv

Total rows: 14
Unique employees: 5

Projects per employee:
A001    3
A003    3
A004    3
A005    3
A002    2
Name: ID, dtype: int64

In [104]:
# Checking the final table.
Final

,ID,First Name,Last Name,Gender,City,Age,Designation Level,Project,Cost,Status
0,A001,John,Alter,M,Paris,25,2,Project 1,1002000.0,Finished
1,A001,John,Alter,M,Paris,25,2,Project 9,2210312.5,Ongoing
2,A001,John,Alter,M,Paris,25,2,Project 11,2000000.0,Failed
3,A002,Alice,Luxumberg,F,London,27,2,Project 2,2000000.0,Ongoing
4,A002,Alice,Luxumberg,F,London,27,2,Project 6,680000.0,Failed
5,A003,Tom,Sabestine,M,Berlin,29,3,Project 3,4500000.0,Finished
6,A003,Tom,Sabestine,M,Berlin,29,3,Project 8,350000.0,Failed
7,A003,Tom,Sabestine,M,Berlin,29,3,Project 10,300000.0,Finished
8,A004,Nina,Adgra,F,Newyork,31,2,Project 4,5500000.0,Ongoing
9,A004,Nina,Adgra,F,Newyork,31,2,Project 12,1000000.0,Ongoing
10,A004,Nina,Adgra,F,Newyork,31,2,Project 13,3000000.0,Finished
11,A005,Amy,Johny,F,Madrid,30,3,Project 5,3250500.0,Finished
12,A005,Amy,Johny,F,Madrid,30,3,Project 7,400000.0,Finished
13,A005,Amy,Johny,F,Madrid,30,3,Project 14,200000.0,Finished

In [105]:
# Task 5
# Add a new bonus column in the Final dataframe.
# Give a 5% bonus concerning project cost only to employees who have finished the projects.

In [106]:
# reading the data
Final = pd.read_csv("final_data.csv")

# checking before adding bonus
print("Before adding Bonus column:\n")
print(Final)

# adding bonus column
Final['Bonus'] = 0
for i in range(len(Final)):
    if Final.loc[i, 'Status'] == 'Finished':
        Final.loc[i, 'Bonus'] = Final.loc[i, 'Cost'] * 0.05

# printing after adding bonus
print("\nAfter adding Bonus column:\n")
print(Final)

# checking total bonus
print("\nTotal Bonus amount:", Final['Bonus'].sum())
print("Projects with bonus:", (Final['Bonus'] > 0).sum())
print("Projects without bonus:", (Final['Bonus'] == 0).sum())

# saving the file
Final.to_csv("final_data.csv", index=False)
print("\nFile saved successfully.")

Before adding Bonus column:

      ID First Name  Last Name Gender     City  Age  Designation Level  \
0   A001       John      Alter      M    Paris   25                  2
1   A001       John      Alter      M    Paris   25                  2
2   A001       John      Alter      M    Paris   25                  2
3   A002      Alice  Luxumberg      F   London   27                  2
4   A002      Alice  Luxumberg      F   London   27                  2
5   A003        Tom  Sabestine      M   Berlin   29                  3
6   A003        Tom  Sabestine      M   Berlin   29                  3
7   A003        Tom  Sabestine      M   Berlin   29                  3
8   A004       Nina      Adgra      F  Newyork   31                  2
9   A004       Nina      Adgra      F  Newyork   31                  2
10  A004       Nina      Adgra      F  Newyork   31                  2
11  A005        Amy      Johny      F   Madrid   30                  3
12  A005        Amy      Johny      F   Madrid   30                  3
13  A005        Amy      Johny      F   Madrid   30                  3

       Project       Cost    Status
0    Project 1  1002000.0  Finished
1    Project 9  2210312.5   Ongoing
2   Project 11  2000000.0    Failed
3    Project 2  2000000.0   Ongoing
4    Project 6   680000.0    Failed
5    Project 3  4500000.0  Finished
6    Project 8   350000.0    Failed
7   Project 10   300000.0  Finished
8    Project 4  5500000.0   Ongoing
9   Project 12  1000000.0   Ongoing
10  Project 13  3000000.0  Finished
11   Project 5  3250500.0  Finished
12   Project 7   400000.0  Finished
13  Project 14   200000.0  Finished

After adding Bonus column:

      ID First Name  Last Name Gender     City  Age  Designation Level  \
0   A001       John      Alter      M    Paris   25                  2
1   A001       John      Alter      M    Paris   25                  2
2   A001       John      Alter      M    Paris   25                  2
3   A002      Alice  Luxumberg      F   London   27                  2
4   A002      Alice  Luxumberg      F   London   27                  2
5   A003        Tom  Sabestine      M   Berlin   29                  3
6   A003        Tom  Sabestine      M   Berlin   29                  3
7   A003        Tom  Sabestine      M   Berlin   29                  3
8   A004       Nina      Adgra      F  Newyork   31                  2
9   A004       Nina      Adgra      F  Newyork   31                  2
10  A004       Nina      Adgra      F  Newyork   31                  2
11  A005        Amy      Johny      F   Madrid   30                  3
12  A005        Amy      Johny      F   Madrid   30                  3
13  A005        Amy      Johny      F   Madrid   30                  3

       Project       Cost    Status   Bonus
0    Project 1  1002000.0  Finished   50100
1    Project 9  2210312.5   Ongoing       0
2   Project 11  2000000.0    Failed       0
3    Project 2  2000000.0   Ongoing       0
4    Project 6   680000.0    Failed       0
5    Project 3  4500000.0  Finished  225000
6    Project 8   350000.0    Failed       0
7   Project 10   300000.0  Finished   15000
8    Project 4  5500000.0   Ongoing       0
9   Project 12  1000000.0   Ongoing       0
10  Project 13  3000000.0  Finished  150000
11   Project 5  3250500.0  Finished  162525
12   Project 7   400000.0  Finished   20000
13  Project 14   200000.0  Finished   10000

Total Bonus amount: 632625
Projects with bonus: 7
Projects without bonus: 7

File saved successfully.

In [107]:
# Checking if the task 5 is done
Final

,ID,First Name,Last Name,Gender,City,Age,Designation Level,Project,Cost,Status,Bonus
0,A001,John,Alter,M,Paris,25,2,Project 1,1002000.0,Finished,50100
1,A001,John,Alter,M,Paris,25,2,Project 9,2210312.5,Ongoing,0
2,A001,John,Alter,M,Paris,25,2,Project 11,2000000.0,Failed,0
3,A002,Alice,Luxumberg,F,London,27,2,Project 2,2000000.0,Ongoing,0
4,A002,Alice,Luxumberg,F,London,27,2,Project 6,680000.0,Failed,0
5,A003,Tom,Sabestine,M,Berlin,29,3,Project 3,4500000.0,Finished,225000
6,A003,Tom,Sabestine,M,Berlin,29,3,Project 8,350000.0,Failed,0
7,A003,Tom,Sabestine,M,Berlin,29,3,Project 10,300000.0,Finished,15000
8,A004,Nina,Adgra,F,Newyork,31,2,Project 4,5500000.0,Ongoing,0
9,A004,Nina,Adgra,F,Newyork,31,2,Project 12,1000000.0,Ongoing,0
10,A004,Nina,Adgra,F,Newyork,31,2,Project 13,3000000.0,Finished,150000
11,A005,Amy,Johny,F,Madrid,30,3,Project 5,3250500.0,Finished,162525
12,A005,Amy,Johny,F,Madrid,30,3,Project 7,400000.0,Finished,20000
13,A005,Amy,Johny,F,Madrid,30,3,Project 14,200000.0,Finished,10000

In [108]:
 # Task 6
# Demote the designation level by 1, whose projects have status “fail”. 
# Delete the employees record whose designation level is above 4.

In [109]:
# reading the data
Final = pd.read_csv("final_data.csv")

# checking before demotion
print("Before demotion:\n")
print(Final[['ID','First Name','Last Name','Designation Level','Project','Status']])

# counting failed projects and demoting
for i in range(len(Final)):
    if Final.loc[i, 'Status'] == 'Failed':
        Final.loc[i, 'Designation Level'] = Final.loc[i, 'Designation Level'] + 1

# printing after demotion
print("\nAfter demotion:\n")
print(Final[['ID','First Name','Last Name','Designation Level','Project','Status']])

# removing employees with level > 4
Final = Final[Final['Designation Level'] <= 4]

# printing cleaned data
print("\nAfter removing disqualified employees:\n")
print(Final[['ID','First Name','Last Name','Designation Level','Project','Status']])

# saving file
Final.to_csv("final_data.csv", index=False)
print("\nFile updated and saved.")

Before demotion:

      ID First Name  Last Name  Designation Level     Project    Status
0   A001       John      Alter                  2   Project 1  Finished
1   A001       John      Alter                  2   Project 9   Ongoing
2   A001       John      Alter                  2  Project 11    Failed
3   A002      Alice  Luxumberg                  2   Project 2   Ongoing
4   A002      Alice  Luxumberg                  2   Project 6    Failed
5   A003        Tom  Sabestine                  3   Project 3  Finished
6   A003        Tom  Sabestine                  3   Project 8    Failed
7   A003        Tom  Sabestine                  3  Project 10  Finished
8   A004       Nina      Adgra                  2   Project 4   Ongoing
9   A004       Nina      Adgra                  2  Project 12   Ongoing
10  A004       Nina      Adgra                  2  Project 13  Finished
11  A005        Amy      Johny                  3   Project 5  Finished
12  A005        Amy      Johny                  3   Project 7  Finished
13  A005        Amy      Johny                  3  Project 14  Finished

After demotion:

      ID First Name  Last Name  Designation Level     Project    Status
0   A001       John      Alter                  2   Project 1  Finished
1   A001       John      Alter                  2   Project 9   Ongoing
2   A001       John      Alter                  3  Project 11    Failed
3   A002      Alice  Luxumberg                  2   Project 2   Ongoing
4   A002      Alice  Luxumberg                  3   Project 6    Failed
5   A003        Tom  Sabestine                  3   Project 3  Finished
6   A003        Tom  Sabestine                  4   Project 8    Failed
7   A003        Tom  Sabestine                  3  Project 10  Finished
8   A004       Nina      Adgra                  2   Project 4   Ongoing
9   A004       Nina      Adgra                  2  Project 12   Ongoing
10  A004       Nina      Adgra                  2  Project 13  Finished
11  A005        Amy      Johny                  3   Project 5  Finished
12  A005        Amy      Johny                  3   Project 7  Finished
13  A005        Amy      Johny                  3  Project 14  Finished

After removing disqualified employees:

      ID First Name  Last Name  Designation Level     Project    Status
0   A001       John      Alter                  2   Project 1  Finished
1   A001       John      Alter                  2   Project 9   Ongoing
2   A001       John      Alter                  3  Project 11    Failed
3   A002      Alice  Luxumberg                  2   Project 2   Ongoing
4   A002      Alice  Luxumberg                  3   Project 6    Failed
5   A003        Tom  Sabestine                  3   Project 3  Finished
6   A003        Tom  Sabestine                  4   Project 8    Failed
7   A003        Tom  Sabestine                  3  Project 10  Finished
8   A004       Nina      Adgra                  2   Project 4   Ongoing
9   A004       Nina      Adgra                  2  Project 12   Ongoing
10  A004       Nina      Adgra                  2  Project 13  Finished
11  A005        Amy      Johny                  3   Project 5  Finished
12  A005        Amy      Johny                  3   Project 7  Finished
13  A005        Amy      Johny                  3  Project 14  Finished

File updated and saved.

In [110]:
# Checking
Final

,ID,First Name,Last Name,Gender,City,Age,Designation Level,Project,Cost,Status,Bonus
0,A001,John,Alter,M,Paris,25,2,Project 1,1002000.0,Finished,50100
1,A001,John,Alter,M,Paris,25,2,Project 9,2210312.5,Ongoing,0
2,A001,John,Alter,M,Paris,25,3,Project 11,2000000.0,Failed,0
3,A002,Alice,Luxumberg,F,London,27,2,Project 2,2000000.0,Ongoing,0
4,A002,Alice,Luxumberg,F,London,27,3,Project 6,680000.0,Failed,0
5,A003,Tom,Sabestine,M,Berlin,29,3,Project 3,4500000.0,Finished,225000
6,A003,Tom,Sabestine,M,Berlin,29,4,Project 8,350000.0,Failed,0
7,A003,Tom,Sabestine,M,Berlin,29,3,Project 10,300000.0,Finished,15000
8,A004,Nina,Adgra,F,Newyork,31,2,Project 4,5500000.0,Ongoing,0
9,A004,Nina,Adgra,F,Newyork,31,2,Project 12,1000000.0,Ongoing,0
10,A004,Nina,Adgra,F,Newyork,31,2,Project 13,3000000.0,Finished,150000
11,A005,Amy,Johny,F,Madrid,30,3,Project 5,3250500.0,Finished,162525
12,A005,Amy,Johny,F,Madrid,30,3,Project 7,400000.0,Finished,20000
13,A005,Amy,Johny,F,Madrid,30,3,Project 14,200000.0,Finished,10000

In [111]:
# Task 7
# Add “Mr.” and “Mrs.” to the first name column and drop the gender column.

In [112]:
# reading the data
Final = pd.read_csv("final_data.csv")

# checking before change
print("Before adding titles:\n")
print(Final[['ID','First Name','Last Name','Gender']])

# adding titles using a simple for loop
for i in range(len(Final)):
    if Final.loc[i, 'Gender'] == 'M':
        Final.loc[i, 'First Name'] = "Mr. " + Final.loc[i, 'First Name']
    else:
        Final.loc[i, 'First Name'] = "Mrs. " + Final.loc[i, 'First Name']

# printing after adding titles
print("\nAfter adding titles:\n")
print(Final[['ID','First Name','Last Name','Gender']])

# dropping gender column
Final = Final.drop('Gender', axis=1)

# checking final dataframe
print("\nAfter dropping Gender column:\n")
print(Final)

# saving file
Final.to_csv("final_data.csv", index=False)
print("\nFile updated and saved.")

Before adding titles:

      ID First Name  Last Name Gender
0   A001       John      Alter      M
1   A001       John      Alter      M
2   A001       John      Alter      M
3   A002      Alice  Luxumberg      F
4   A002      Alice  Luxumberg      F
5   A003        Tom  Sabestine      M
6   A003        Tom  Sabestine      M
7   A003        Tom  Sabestine      M
8   A004       Nina      Adgra      F
9   A004       Nina      Adgra      F
10  A004       Nina      Adgra      F
11  A005        Amy      Johny      F
12  A005        Amy      Johny      F
13  A005        Amy      Johny      F

After adding titles:

      ID  First Name  Last Name Gender
0   A001    Mr. John      Alter      M
1   A001    Mr. John      Alter      M
2   A001    Mr. John      Alter      M
3   A002  Mrs. Alice  Luxumberg      F
4   A002  Mrs. Alice  Luxumberg      F
5   A003     Mr. Tom  Sabestine      M
6   A003     Mr. Tom  Sabestine      M
7   A003     Mr. Tom  Sabestine      M
8   A004   Mrs. Nina      Adgra      F
9   A004   Mrs. Nina      Adgra      F
10  A004   Mrs. Nina      Adgra      F
11  A005    Mrs. Amy      Johny      F
12  A005    Mrs. Amy      Johny      F
13  A005    Mrs. Amy      Johny      F

After dropping Gender column:

      ID  First Name  Last Name     City  Age  Designation Level     Project  \
0   A001    Mr. John      Alter    Paris   25                  2   Project 1
1   A001    Mr. John      Alter    Paris   25                  2   Project 9
2   A001    Mr. John      Alter    Paris   25                  3  Project 11
3   A002  Mrs. Alice  Luxumberg   London   27                  2   Project 2
4   A002  Mrs. Alice  Luxumberg   London   27                  3   Project 6
5   A003     Mr. Tom  Sabestine   Berlin   29                  3   Project 3
6   A003     Mr. Tom  Sabestine   Berlin   29                  4   Project 8
7   A003     Mr. Tom  Sabestine   Berlin   29                  3  Project 10
8   A004   Mrs. Nina      Adgra  Newyork   31                  2   Project 4
9   A004   Mrs. Nina      Adgra  Newyork   31                  2  Project 12
10  A004   Mrs. Nina      Adgra  Newyork   31                  2  Project 13
11  A005    Mrs. Amy      Johny   Madrid   30                  3   Project 5
12  A005    Mrs. Amy      Johny   Madrid   30                  3   Project 7
13  A005    Mrs. Amy      Johny   Madrid   30                  3  Project 14

         Cost    Status   Bonus
0   1002000.0  Finished   50100
1   2210312.5   Ongoing       0
2   2000000.0    Failed       0
3   2000000.0   Ongoing       0
4    680000.0    Failed       0
5   4500000.0  Finished  225000
6    350000.0    Failed       0
7    300000.0  Finished   15000
8   5500000.0   Ongoing       0
9   1000000.0   Ongoing       0
10  3000000.0  Finished  150000
11  3250500.0  Finished  162525
12   400000.0  Finished   20000
13   200000.0  Finished   10000

File updated and saved.

In [113]:
# Task 8
# Promote designation level by 1 for the employees whose age is more than 29 years using IF condition.

In [114]:
# reading the data
Final = pd.read_csv("final_data.csv")
# checking data before promotion
print("Before promotion:\n")
print(Final[['ID','First Name','Last Name','Age','Designation Level']])

# loop through each row
for i in range(len(Final)):
    age = Final.loc[i, 'Age']
    level = Final.loc[i, 'Designation Level']
    # if age is more than 29, decrease level by 1
    if age > 29:
        if level > 1:
            Final.loc[i, 'Designation Level'] = level - 1
        else:
            Final.loc[i, 'Designation Level'] = 1

# printing after promotion
print("\nAfter promotion:\n")
print(Final[['ID','First Name','Last Name','Age','Designation Level']])

# saving the file
Final.to_csv("final_data.csv", index=False)
print("\nFile updated and saved.")

Before promotion:

      ID  First Name  Last Name  Age  Designation Level
0   A001    Mr. John      Alter   25                  2
1   A001    Mr. John      Alter   25                  2
2   A001    Mr. John      Alter   25                  3
3   A002  Mrs. Alice  Luxumberg   27                  2
4   A002  Mrs. Alice  Luxumberg   27                  3
5   A003     Mr. Tom  Sabestine   29                  3
6   A003     Mr. Tom  Sabestine   29                  4
7   A003     Mr. Tom  Sabestine   29                  3
8   A004   Mrs. Nina      Adgra   31                  2
9   A004   Mrs. Nina      Adgra   31                  2
10  A004   Mrs. Nina      Adgra   31                  2
11  A005    Mrs. Amy      Johny   30                  3
12  A005    Mrs. Amy      Johny   30                  3
13  A005    Mrs. Amy      Johny   30                  3

After promotion:

      ID  First Name  Last Name  Age  Designation Level
0   A001    Mr. John      Alter   25                  2
1   A001    Mr. John      Alter   25                  2
2   A001    Mr. John      Alter   25                  3
3   A002  Mrs. Alice  Luxumberg   27                  2
4   A002  Mrs. Alice  Luxumberg   27                  3
5   A003     Mr. Tom  Sabestine   29                  3
6   A003     Mr. Tom  Sabestine   29                  4
7   A003     Mr. Tom  Sabestine   29                  3
8   A004   Mrs. Nina      Adgra   31                  1
9   A004   Mrs. Nina      Adgra   31                  1
10  A004   Mrs. Nina      Adgra   31                  1
11  A005    Mrs. Amy      Johny   30                  2
12  A005    Mrs. Amy      Johny   30                  2
13  A005    Mrs. Amy      Johny   30                  2

File updated and saved.

In [115]:
# Checking
Final

,ID,First Name,Last Name,City,Age,Designation Level,Project,Cost,Status,Bonus
0,A001,Mr. John,Alter,Paris,25,2,Project 1,1002000.0,Finished,50100
1,A001,Mr. John,Alter,Paris,25,2,Project 9,2210312.5,Ongoing,0
2,A001,Mr. John,Alter,Paris,25,3,Project 11,2000000.0,Failed,0
3,A002,Mrs. Alice,Luxumberg,London,27,2,Project 2,2000000.0,Ongoing,0
4,A002,Mrs. Alice,Luxumberg,London,27,3,Project 6,680000.0,Failed,0
5,A003,Mr. Tom,Sabestine,Berlin,29,3,Project 3,4500000.0,Finished,225000
6,A003,Mr. Tom,Sabestine,Berlin,29,4,Project 8,350000.0,Failed,0
7,A003,Mr. Tom,Sabestine,Berlin,29,3,Project 10,300000.0,Finished,15000
8,A004,Mrs. Nina,Adgra,Newyork,31,1,Project 4,5500000.0,Ongoing,0
9,A004,Mrs. Nina,Adgra,Newyork,31,1,Project 12,1000000.0,Ongoing,0
10,A004,Mrs. Nina,Adgra,Newyork,31,1,Project 13,3000000.0,Finished,150000
11,A005,Mrs. Amy,Johny,Madrid,30,2,Project 5,3250500.0,Finished,162525
12,A005,Mrs. Amy,Johny,Madrid,30,2,Project 7,400000.0,Finished,20000
13,A005,Mrs. Amy,Johny,Madrid,30,2,Project 14,200000.0,Finished,10000

In [116]:
# Task 9
# Add the cost of all projects for each Employee and save it in new dataframe
# “TotalProjCost” with three columns ID, First Name, and Total cost

In [117]:
# reading the data
Final = pd.read_csv("final_data.csv")

# checking data
print("Project data:\n")
print(Final[['ID','First Name','Project','Cost']])

# calculating total cost for each employee
TotalProjCost = Final.groupby(['ID','First Name'])['Cost'].sum().reset_index()

# renaming the column
TotalProjCost.rename(columns={'Cost':'Total Cost'}, inplace=True)

# printing result
print("\nTotal project cost per employee:\n")
print(TotalProjCost)

# saving the new file
TotalProjCost.to_csv("TotalProjCost.csv", index=False)
print("\nFile saved as TotalProjCost.csv")

Project data:

      ID  First Name     Project       Cost
0   A001    Mr. John   Project 1  1002000.0
1   A001    Mr. John   Project 9  2210312.5
2   A001    Mr. John  Project 11  2000000.0
3   A002  Mrs. Alice   Project 2  2000000.0
4   A002  Mrs. Alice   Project 6   680000.0
5   A003     Mr. Tom   Project 3  4500000.0
6   A003     Mr. Tom   Project 8   350000.0
7   A003     Mr. Tom  Project 10   300000.0
8   A004   Mrs. Nina   Project 4  5500000.0
9   A004   Mrs. Nina  Project 12  1000000.0
10  A004   Mrs. Nina  Project 13  3000000.0
11  A005    Mrs. Amy   Project 5  3250500.0
12  A005    Mrs. Amy   Project 7   400000.0
13  A005    Mrs. Amy  Project 14   200000.0

Total project cost per employee:

     ID  First Name  Total Cost
0  A001    Mr. John   5212312.5
1  A002  Mrs. Alice   2680000.0
2  A003     Mr. Tom   5150000.0
3  A004   Mrs. Nina   9500000.0
4  A005    Mrs. Amy   3850500.0

File saved as TotalProjCost.csv

In [118]:
# Checking
TotalProjCost

     ID  First Name  Total Cost
0  A001    Mr. John   5212312.5
1  A002  Mrs. Alice   2680000.0
2  A003     Mr. Tom   5150000.0
3  A004   Mrs. Nina   9500000.0
4  A005    Mrs. Amy   3850500.0

In [119]:
#  Task 10
# Print all the employee details whose city name contains the letter “o” in it.

In [120]:
import pandas as pd

# reading the data
Final = pd.read_csv("final_data.csv")

# checking city data
print("Employee and City data:\n")
print(Final[['ID','First Name','Last Name','City']])

# filtering cities that have letter 'o'
filtered = Final[Final['City'].str.contains('o', case=False, na=False)]

# printing result
print("\nEmployees whose city name has letter 'o':\n")
print(filtered[['ID','First Name','Last Name','City']])

# saving filtered data
filtered.to_csv("Employees_with_o.csv", index=False)
print("\nFile saved as Employees_with_o.csv")

Employee and City data:

      ID  First Name  Last Name     City
0   A001    Mr. John      Alter    Paris
1   A001    Mr. John      Alter    Paris
2   A001    Mr. John      Alter    Paris
3   A002  Mrs. Alice  Luxumberg   London
4   A002  Mrs. Alice  Luxumberg   London
5   A003     Mr. Tom  Sabestine   Berlin
6   A003     Mr. Tom  Sabestine   Berlin
7   A003     Mr. Tom  Sabestine   Berlin
8   A004   Mrs. Nina      Adgra  Newyork
9   A004   Mrs. Nina      Adgra  Newyork
10  A004   Mrs. Nina      Adgra  Newyork
11  A005    Mrs. Amy      Johny   Madrid
12  A005    Mrs. Amy      Johny   Madrid
13  A005    Mrs. Amy      Johny   Madrid

Employees whose city name has letter 'o':

      ID  First Name  Last Name     City
3   A002  Mrs. Alice  Luxumberg   London
4   A002  Mrs. Alice  Luxumberg   London
8   A004   Mrs. Nina      Adgra  Newyork
9   A004   Mrs. Nina      Adgra  Newyork
10  A004   Mrs. Nina      Adgra  Newyork

File saved as Employees_with_o.csv

In [121]:
# Checking 
filtered

,ID,First Name,Last Name,City,Age,Designation Level,Project,Cost,Status,Bonus
3,A002,Mrs. Alice,Luxumberg,London,27,2,Project 2,2000000.0,Ongoing,0
4,A002,Mrs. Alice,Luxumberg,London,27,3,Project 6,680000.0,Failed,0
8,A004,Mrs. Nina,Adgra,Newyork,31,1,Project 4,5500000.0,Ongoing,0
9,A004,Mrs. Nina,Adgra,Newyork,31,1,Project 12,1000000.0,Ongoing,0
10,A004,Mrs. Nina,Adgra,Newyork,31,1,Project 13,3000000.0,Finished,150000